; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-1-8)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	)
(:init
	(at plane1 city2)
	(= (capacity plane1) 13484)
	(= (fuel plane1) 2761)
	(= (slow-burn plane1) 5)
	(= (fast-burn plane1) 19)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 5)
	(at person1 city4)
	(at person2 city1)
	(at person3 city0)
	(at person4 city2)
	(at person5 city0)
	(at person6 city2)
	(at person7 city4)
	(at person8 city1)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 843)
	(= (distance city0 city2) 546)
	(= (distance city0 city3) 832)
	(= (distance city0 city4) 524)
	(= (distance city1 city0) 843)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 675)
	(= (distance city1 city3) 661)
	(= (distance city1 city4) 981)
	(= (distance city2 city0) 546)
	(= (distance city2 city1) 675)
	(= (distance city2 city2) 0)
	(= (distance city2 city3) 917)
	(= (distance city2 city4) 731)
	(= (distance city3 city0) 832)
	(= (distance city3 city1) 661)
	(= (distance city3 city2) 917)
	(= (distance city3 city3) 0)
	(= (distance city3 city4) 806)
	(= (distance city4 city0) 524)
	(= (distance city4 city1) 981)
	(= (distance city4 city2) 731)
	(= (distance city4 city3) 806)
	(= (distance city4 city4) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at person2 city0)
	(at person3 city2)
	(at person4 city0)
	(at person5 city0)
	(at person6 city0)
	(at person7 city3)
	(at person8 city2)
	))

(:metric minimize (+ (* 1 (total-time))  (* 5 (total-fuel-used))))
)

; plan
1. (board person4 plane1 city2)
   deleted: (at person4 city2)
   added: (in person4 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 1 of 7
2. (board person6 plane1 city2)
   deleted: (at person6 city2)
   added: (in person6 plane1)
   changed: (onboard plane1) from 1 to 2
   goals met: 1 of 7
3. (refuel plane1 city2)
   changed: (fuel plane1) from 2761 to 13484
   goals met: 1 of 7
4. (fly plane1 city2 city0)
   deleted: (at plane1 city2)
   added: (at plane1 city0)
   changed: (total-fuel-used) from 0 to 2730, (fuel plane1) from 13484 to 10754
   goals met: 1 of 7
5. (debark person4 plane1 city0)
   deleted: (in person4 plane1)
   added: (at person4 city0)
   changed: (onboard plane1) from 2 to 1
   goals met: 2 of 7
6. (debark person6 plane1 city0)
   deleted: (in person6 plane1)
   added: (at person6 city0)
   changed: (onboard plane1) from 1 to 0
   goals met: 3 of 7
7. (board person3 plane1 city0)
   deleted: (at person3 city0)
   added: (in person3 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 3 of 7
8. (fly plane1 city0 city2)
   deleted: (at plane1 city0)
   added: (at plane1 city2)
   changed: (total-fuel-used) from 2730 to 5460, (fuel plane1) from 10754 to 8024
   goals met: 3 of 7
9. (debark person3 plane1 city2)
   deleted: (in person3 plane1)
   added: (at person3 city2)
   changed: (onboard plane1) from 1 to 0
   goals met: 4 of 7
10. (fly plane1 city2 city1)
   deleted: (at plane1 city2)
   added: (at plane1 city1)
   changed: (total-fuel-used) from 5460 to 8835, (fuel plane1) from 8024 to 4649
   goals met: 4 of 7
11. (board person2 plane1 city1)
   deleted: (at person2 city1)
   added: (in person2 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 4 of 7
12. (board person8 plane1 city1)
   deleted: (at person8 city1)
   added: (in person8 plane1)
   changed: (onboard plane1) from 1 to 2
   goals met: 4 of 7
13. (fly plane1 city1 city0)
   deleted: (at plane1 city1)
   added: (at plane1 city0)
   changed: (total-fuel-used) from 8835 to 13050, (fuel plane1) from 4649 to 434
   goals met: 4 of 7
14. (debark person2 plane1 city0)
   deleted: (in person2 plane1)
   added: (at person2 city0)
   changed: (onboard plane1) from 2 to 1
   goals met: 5 of 7
15. (refuel plane1 city0)
   changed: (fuel plane1) from 434 to 13484
   goals met: 5 of 7
16. (fly plane1 city0 city4)
   deleted: (at plane1 city0)
   added: (at plane1 city4)
   changed: (total-fuel-used) from 13050 to 15670, (fuel plane1) from 13484 to 10864
   goals met: 5 of 7
17. (board person7 plane1 city4)
   deleted: (at person7 city4)
   added: (in person7 plane1)
   changed: (onboard plane1) from 1 to 2
   goals met: 5 of 7
18. (fly plane1 city4 city3)
   deleted: (at plane1 city4)
   added: (at plane1 city3)
   changed: (total-fuel-used) from 15670 to 19700, (fuel plane1) from 10864 to 6834
   goals met: 5 of 7
19. (debark person7 plane1 city3)
   deleted: (in person7 plane1)
   added: (at person7 city3)
   changed: (onboard plane1) from 2 to 1
   goals met: 6 of 7
20. (fly plane1 city3 city2)
   deleted: (at plane1 city3)
   added: (at plane1 city2)
   changed: (total-fuel-used) from 19700 to 24285, (fuel plane1) from 6834 to 2249
   goals met: 6 of 7
21. (debark person8 plane1 city2)
   deleted: (in person8 plane1)
   added: (at person8 city2)
   changed: (onboard plane1) from 1 to 0
   goals met: 7 of 7
